## ❌ Apply Failed

**Deployment:** `82e39e00-18c6-4307-9fad-02af4d4248d8`

### Error

```
[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1merror deploying app (3e3597a5-68d7-4004-ae83-33b50881a46a) (deployment ID: b55cb93f-dc18-435e-9104-485bd0ab5c80):
[31m│[0m [0mgodo.DeploymentProgress{PendingSteps:3, RunningSteps:0, SuccessSteps:1, ErrorSteps:1, TotalSteps:5, Steps:[godo.DeploymentProgressStep{Name:"build", Status:"ERROR", Steps:[godo.DeploymentProgressStep{Name:"initialize", Status:"SUCCESS", StartedAt:time.Time{wall:, ext:}, EndedAt:time.Time{wall:, ext:}, ComponentName:"", MessageBase:""} godo.DeploymentProgressStep{Name:"components", Status:"ERROR", Steps:[godo.DeploymentProgressStep{Name:"svelte-minesweeper-site", Status:"ERROR", StartedAt:time.Time{wall:, ext:}, EndedAt:time.Time{wall:, ext:}, Reason:godo.DeploymentProgressStepReason{Code:"BuildJobTerminated", Message:"Your build job failed because it was terminated. This often happens due to resource exhaustion."}, ComponentName:"svelte-minesweeper-site", MessageBase:"Building static site"}], StartedAt:time.Time{wall:, ext:}, EndedAt:time.Time{wall:, ext:}, Reason:godo.DeploymentProgressStepReason{Code:"BuildJobTerminated", Message:"Your build job failed because it was terminated. This often happens due to resource exhaustion."}, ComponentName:"", MessageBase:""}], StartedAt:time.Time{wall:, ext:}, EndedAt:time.Time{wall:, ext:}, Reason:godo.DeploymentProgressStepReason{Code:"BuildJobTerminated", Message:"Your build job failed because it was terminated. This often happens due to resource exhaustion."}, ComponentName:"", MessageBase:""} godo.DeploymentProgressStep{Name:"deploy", Status:"PENDING", Steps:[godo.DeploymentProgressStep{Name:"initialize", Status:"PENDING", StartedAt:time.Time{wall:, ext:}, EndedAt:time.Time{wall:, ext:}, ComponentName:"", MessageBase:""} godo.DeploymentProgressStep{Name:"components", Status:"PENDING", StartedAt:time.Time{wall:, ext:}, EndedAt:time.Time{wall:, ext:}, ComponentName:"", MessageBase:""} godo.DeploymentProgressStep{Name:"finalize", Status:"PENDING", StartedAt:time.Time{wall:, ext:}, EndedAt:time.Time{wall:, ext:}, ComponentName:"", MessageBase:""}], StartedAt:time.Time{wall:, ext:}, EndedAt:time.Time{wall:, ext:}, ComponentName:"", MessageBase:""}], SummarySteps:[godo.DeploymentProgressStep{Name:"build.components.svelte-minesweeper-site", Status:"ERROR", StartedAt:time.Time{wall:, ext:}, EndedAt:time.Time{wall:, ext:}, Reason:godo.DeploymentProgressStepReason{Code:"BuildJobTerminated", Message:"Your build job failed because it was terminated. This often happens due to resource exhaustion."}, ComponentName:"svelte-minesweeper-site", MessageBase:"Building static site"}]}[0m
[31m│[0m [0m
[31m│[0m [0m[0m  with digitalocean_app.svelte_minesweeper,
[31m│[0m [0m  on main.tf line 8, in resource "digitalocean_app" "svelte_minesweeper":
[31m│[0m [0m   8: resource "digitalocean_app" "svelte_minesweeper" [4m{[0m[0m
[31m│[0m [0m
[31m╵[0m[0m
```

<details>
<summary>Show Full Output</summary>

```
FullRestore Sandbox Container
OpenTofu version: OpenTofu v1.11.2
Workspace: /workspace

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Finding digitalocean/digitalocean versions matching "~> 2.78.0"...
- Installing digitalocean/digitalocean v2.78.0...
- Installed digitalocean/digitalocean v2.78.0 (signed, key ID [0m[1mF82037E524B9C0E8[0m[0m)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.[0m

[0m[1m[32mOpenTofu has been successfully initialized![0m[32m[0m
[32m[1mSuccess![0m The configuration is valid.[0m

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

OpenTofu will perform the following actions:

[1m  # digitalocean_app.svelte_minesweeper[0m will be created
[0m  [32m+[0m[0m resource "digitalocean_app" "svelte_minesweeper" {
      [32m+[0m[0m active_deployment_id = (known after apply)
      [32m+[0m[0m created_at           = (known after apply)
      [32m+[0m[0m default_ingress      = (known after apply)
      [32m+[0m[0m deployment_per_page  = 20
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m live_domain          = (known after apply)
      [32m+[0m[0m live_url             = (known after apply)
      [32m+[0m[0m project_id           = (known after apply)
      [32m+[0m[0m updated_at           = (known after apply)
      [32m+[0m[0m urn                  = (known after apply)

      [32m+[0m[0m dedicated_ips (known after apply)

      [32m+[0m[0m spec {
          [32m+[0m[0m disable_edge_cache              = false
          [32m+[0m[0m disable_email_obfuscation       = false
          [32m+[0m[0m domains                         = (known after apply)
          [32m+[0m[0m enhanced_threat_control_enabled = false
          [32m+[0m[0m features                        = (known after apply)
          [32m+[0m[0m name                            = "svelte-minesweeper"
          [32m+[0m[0m region                          = "nyc"

          [32m+[0m[0m domain (known after apply)

          [32m+[0m[0m ingress (known after apply)

          [32m+[0m[0m static_site {
              [32m+[0m[0m build_command    = "npm run build"
              [32m+[0m[0m environment_slug = "node-js"
              [32m+[0m[0m name             = "svelte-minesweeper-site"
              [32m+[0m[0m output_dir       = ".svelte-kit"

              [32m+[0m[0m github {
                  [32m+[0m[0m branch         = "main"
                  [32m+[0m[0m deploy_on_push = true
                  [32m+[0m[0m repo           = "douglasswm/svelte-mine-game"
                }

              [32m+[0m[0m routes {
                  [32m+[0m[0m path = "/"
                }
            }
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m app_active_deployment_id = (known after apply)
  [32m+[0m[0m app_default_ingress      = (known after apply)
  [32m+[0m[0m app_id                   = (known after apply)
  [32m+[0m[0m app_url                  = (known after apply)
  [32m+[0m[0m app_urn                  = (known after apply)
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with digitalocean_app.svelte_minesweeper,
[33m│[0m [0m  on main.tf line 28, in resource "digitalocean_app" "svelte_minesweeper":
[33m│[0m [0m  28:       routes [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0mService level routes are deprecated in favor of ingresses
[33m╵[0m[0m
[0m[1mdigitalocean_app.svelte_minesweeper: Creating...[0m[0m
[0m[1mdigitalocean_app.svelte_minesweeper: Still creating... [10s elapsed][0m[0m
[0m[1mdigitalocean_app.svelte_minesweeper: Still creating... [20s elapsed][0m[0m
[0m[1mdigitalocean_app.svelte_minesweeper: Still creating... [30s elapsed][0m[0m
[0m[1mdigitalocean_app.svelte_minesweeper: Still creating... [40s elapsed][0m[0m
[0m[1mdigitalocean_app.svelte_minesweeper: Still creating... [50s elapsed][0m[0m
[0m[1mdigitalocean_app.svelte_minesweeper: Still creating... [1m0s elapsed][0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with digitalocean_app.svelte_minesweeper,
[33m│[0m [0m  on main.tf line 28, in resource "digitalocean_app" "svelte_minesweeper":
[33m│[0m [0m  28:       routes [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0mService level routes are deprecated in favor of ingresses
[33m╵[0m[0m
```

</details>

---
*Fix the errors and create a new commit, or comment `fullrestore plan` to re-run*
